### 命令行等级

1. Router>enable   用户模式
2. Router#               特权模式  只能看所有配置  重启

3. Router#configure  全局模式   可以做设备的任何操作任何功能，不能看
   Configuring from terminal, memory, or network [terminal]? 
   Enter configuration commands, one per line.  End with CNTL/Z.
   Router(config)#

**(!初次配置)配置IP地址**

```tcl
Router(config)#int e0/0   进入这个接口
Router(config-if)#             
Router(config-if)#no shutdown   接口打开，类似于重启

Router(config-if)#
*Sep 26 12:19:43.027: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Sep 26 12:19:44.038: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
Router(config-if)#ip address 192.168.3.1 255.255.255.0
```

**查看IP地址**

```tcl
Router(config)#exit 
Router#show
*Sep 26 12:22:39.714: %SYS-5-CONFIG_I: Configured from console by console
Router#show running-config int e0/0   查看第一个开启地址
Building configuration...

Current configuration : 67 bytes
!
interface Ethernet0/0
 ip address 192.168.1.1 255.255.255.0
end
```

**(!初次配置)配置名字**

```tcl
Router(config)#hostname RT2

RT1#ping 192.168.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
.!!!!             **点代表丢包，感叹号代表通信，rt1知道rt2的mac地址吗？第一个包没有mac地址触发。**

Success rate is 80 percent (4/5), round-trip min/avg/max = 1/5/8 ms
RT1#
```

**再次ping的时候第一个包就不丢了**

```shell
RT1#ping 192.168.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/5/7 m

RT1(config)#do show runni    使用do可以提权
RT1(config)#do show running-config 
```

### 安全管理

****

交换机 ---路由器  ---网络设备  --有很多种管理方式

**1，Consolo口去管理 Console口是[cisco](https://baike.baidu.com/item/cisco/414994)路由器配置用的，最常用的就是[console](https://baike.baidu.com/item/console/10509035)配置口。**

波拓率，就是交换机和路由器之间的配置速度，无所谓差不多，购买设备的说明书上有写到，----神州数码--115200-9600比较常见

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/71q15cSPJfL._AC_SL1500_.jpg)

**(!初次配置)配置console线的密码**

```tcl
配置密码：
RT1(config)#line console 0
RT1(config-line)#password 123123
RT1(config-line)#
```

**(!初次配置)2,可以通过telnet远程直接到设备上去配置，所以还需要配置telnet远程登录密码**

```tcl
配置telnat可用
RT1(config)#
RT1(config)#line vty 0 4    VTY虚拟终端接口，就是用来电脑远程进来的,表示五个终端接口  VTY0 VTY1 VTY2 VTY3 VTY4，最多可以被五个运维人员连接
RT1(config-line)#password 123123    配置密码为cisco
RT1(config-line)#transport input telnet     允许telnat登录，默认情况下拒绝所有接口登录
```

**(!初次配置)3,配置特权模式的密码 不然别人远程无法进入特权模式**

```tcl
再RT1配置密码
RT1(config)#
RT1(config)#enable pass
RT1(config)#enable password 123123
```

```tcl
然后在RT2登录,并且登录特权模式
RT2#telnet 192.168.3.1
Trying 192.168.1.1 ... Open
User Access Verification
Password: 
RT1>ena
Password: 
RT1#
RT1#
```

**Telnet缺点**

> Telnet不安全
> SSH就是telnet的加密版本
> SSH-NP的时候 有些命令理解不了
> 命令错误的时候需要等待  ctrl+shift+6  eve模拟器不行,真机也不行 
> 解决方案；RT2(config)#no ip domain lookup   不会去主动解析主机

**(!初次配置)命令卡死防止**

```tcl
RT2(config)#RT2(config)#no ip domain lookup 
```

### 静态路由

**直连路由--接口配置一个IP地址就会生成直连路由**

```tcl
RT2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.0/24 is directly connected, Ethernet0/0
L        192.168.1.2/32 is directly connected, Ethernet0/0
```

**静态路由**

工程师一条一条手工打上去的。

> 目标网段加+目标掩码 +下一跳地址
> 192.168.2.0 255.255.255.0 e0/1
> **以后去往2.0网段的数据包直接从e0/1接口发出去**
>
> + 分支 默认路由--不管你去往任何地方你只需要一条命令  
> + 0.0.0.0 0.0.0.0 e0/1 不管去往任何地址都从e0/1接口发出去
> + 默认路由==网关 就是家里路由器的IP地址，家里所有的包都给路由器 路由交给运营商

**动态路由**

不需要大量的配置，配置比较少，路由器之间自动同步路由表。

相互交互路由表信息，我把我知道的告诉你，动态的自动的去完成。当网络拓扑发生变化的时候，会自动的收敛。

收敛包含路由增加 路由减少 OSPF动态路由协议。

### 动态路由的分类

**内部网关路由协议(IGP)  用于在自治系统内部路由**

+ 距离矢量路由协议

  - 传递的就是实际的路由信息（目标网段加+目标掩码 ）

  - RIP EIGRP典型距离矢量
  - 基于传文方式，传递路由信息---并不了解网络拓扑
  - 路由环路问题--水平分割(我告诉你的传递路由你不能回传回来)有很多的防环原则

+ 链路状态路由协议

  - 传递的是路由信息+拓扑信息（邻居是谁，我旁边有啥）---LSA（链路状态）
  - 链路状态不能直接去使用，需要进行计算（根据--SPF算法，避免在一定意义上避免环路）
  - OSPF，ISIS典型的状态路由协议--LSA路由协议
  - 了解网络的拓扑

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/3333.jpg)

**外部网关路由协议(EGP) 用于在自治系统之间路由  **

+ EGP  --比较老的用法
+ BGP  ---现网使用。能调节是级别比较高的工程师



![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/EGP.jpg)



**路由器一和路由器二收到了相同的路由会选择哪个？？？**![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/Mssd.png)

1. 路由协议(华为优先级)（思科-管理距离）  （这个最优先，度量值最低）

   EIGRP -- 90

   OSPF -- 110

   越小越优先

2. 还有路由网络带宽速度协议决定（这个不是最优先，度量值相对较高）

   越快越优先

### 动态路由更新机制

- [x] 广播--喊大喇叭--(IP:255.255.255.255)地址里面去--造成资源浪费

- [x] 单播--一对一进行

- [x] 组播--一对多进行，只有运行EIGRP 的设备才会接收

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/multipatys.png)

