### 配置EIGRP

**开启并且给与一个自治系统编号 Router EIGRP**

```tcl
Router(config)#router eigrp 90    全网都要写90，这个系统编号是可以自定义的。
Router(config-router)#
```

**宣布直连网段**

network 192.168.1.0  0.0.0.255 

**通配符--掩码--反掩码   写错了会被自动翻转**

225.255.255.0--->0.0.0.255

```tcl
Router(config-router)#network 192.168.1.0 0.0.0.255 
Router(config-router)#network 192.168.3.0 0.0.0.255
```

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/2344.png)

**查看路由表**

```tcl
Router#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      4.0.0.0/32 is subnetted, 1 subnets
C        4.4.4.4 is directly connected, Loopback1
D     192.168.1.0/24 [90/307200] via 192.168.2.1, 00:02:18, Ethernet0/0   
## D在此处表示EIGRP的意思   [90/307200]90表示优先级管理距离  307200是度量值（用于相同协议之间比较的东西）
      192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.2.0/24 is directly connected, Ethernet0/0
L        192.168.2.2/32 is directly connected, Ethernet0/0
D     192.168.3.0/24 [90/307200] via 192.168.4.1, 00:02:18, Ethernet0/1
      192.168.4.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.4.0/24 is directly connected, Ethernet0/1
L        192.168.4.2/32 is directly connected, Ethernet0/1
```

### EIGRP邻居建立

5秒发送一次  15秒超时

hello 目的224.0.0.10 组播地址，只有运行EIGRP协议的，路由才会接受和支持

### EIGRP的数据包

+ hello包 用于建立邻居，维护邻居
+ 路由更新包 (UPDATE)，邻居建立之后发送路由更新--一般组播地址
+ Query包--查询，当某条路由丢失向邻居查询关于这条路由的信息
+ Repaly包--回复Query包
+ Ack包，确认信息包----TCP  **确认这个Update--query确认Repaly  就是确认上述三包，hello包不需要确认**

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/456233848.png)



### EIGRP三张表

EIGRP路由表 --- 路由表

EIGRP邻居表 --- 邻居表

EIGRP拓扑表 --- 能到达目的网络的路由都会加入到此表，不是所有的路由都能加到拓扑表，必须满足FC可行条件

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/ss456233848.png)

### DUAL算法 弥散更新算法

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/m4326598.png)



### OSPF网络类型

**点到点网络**：不用进行DR和BDR的选举，直接形成邻接关系，P2P网络是指一段链路上只能连接两台设备的环境，例如PPP链路
当两台设备通过PPP链路进行连接，设备上采用的接口封装协议就是PPP，当激活OSPF时，OSFP会根据接口的数据链路层封装将它网络类型设置为P2P，采用HDLC封装时，缺省网络类型也为P2P。

**广播多路访问**：以太网网络，需要进行DR和BDR的选举BMA是一个支持广播的网络环境，允许多台设备接入，任意两台设备都可以进行二层通信。
在BMA网络中需要选举DR和BDR

**非广播多路访问（完全相连的FR网络）**：不能发送广播和组播报文，所以在帧中继网络中，ospf没有办法通过发送hello包来简历邻居关系，只用使用单播方式来制定邻居，命令如下：peer x.x.x.x

**点到多点网络（不完全相连的FR网络）**：也是用点到多点的方式来建立连接，不需要进行DR和BDR的选举
这种网络类型并不是根据接口封装自己设置的，而是需要管理员手动配置。在这种网络种无需选举DR和BDR。
OSPF在P2MP网络类型的接口上，以组播的形式发送hello报文，以单播的形式发送其他报文。
缺省状态下hello报文的发送间隔为30S.

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/36598.png)



OSPF数据包

Hello包  --建立邻居--维护邻居
DBD---LSA描述信息--LSA的缩略版本--理解为LSA的目录
LSR---用于请求LSA
LSU---LSU里包含LSA---把LSU理解为盘子。LSA是菜
LSACK---用于确认LSU

用盘子装着菜



**邻居建立过程**

Down状态

init状态

2way状态

Xstart  -- 并非真正的DD报文 选举

RouterId 大的一方成为主设备

Exchange

Loading

### OSPF配置

```tcl
Router(config)#
Router(config)#router ospf 110
Router(config-router)#router-id 1.1.1.1
Router(config-router)#network 12.1.1.0 0.0.0.255 area 0

Router#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/BDR        00:00:36    12.1.1.2        Ethernet0/0
```

```tcl
RT2(config)#
RT2(config)#router ospf
RT2(config)#router ospf 110
RT2(config-router)#router-id 2.2.2.2
RT2(config-router)#network 12.1.1.0 0.0.0.255 area 0
RT2(config-router)#
*Oct  5 23:29:36.894: %OSPF-5-ADJCHG: Process 110, Nbr 1.1.1.1 on Ethernet0/0 from LOADING to FULL, Loading Done
RT2(config-router)#
RT2(config-router)#network 24.1.1.0 0.0.0.255 area 0

RT2#show ip ospf neighbor 

###DR和BDR是在一个网段内进行选举

Neighbor ID     Pri   State           Dead Time   Address         Interface
4.4.4.4           1   FULL/BDR        00:00:30    24.1.1.2        Ethernet0/1
1.1.1.1           1   FULL/DR         00:00:32    12.1.1.1        Ethernet0/0
RT2
```

```tcl
RT4(config)#router ospf 110
RT4(config-router)#router-id 4.4.4.4
RT4(config-router)#network 24.1.1.0 0.0.0.255 area 0
RT4(config-router)#
*Oct  5 23:33:27.652: %OSPF-5-ADJCHG: Process 110, Nbr 2.2.2.2 on Ethernet0/0 from LOADING to FULL, Loading Done
RT4(config-router)#network 4.4.4.4 0.0.0.0 area 0
```

**修改点对点访问  修改之后不需要DR和BDR，点对点不存在LSA重复所有不需要，DRBDR选举需要时间的**

```tcl
RT2(config-if)#ip ospf network point-
RT2(config-if)#ip ospf network point-to-p
RT2(config-if)#ip ospf network point-to-point 
```



![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/36265984512.png)



























