### NAT 网络地址转换

将私网IP地址和公网IP地址转换

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/235698sdfg.png)

NAT--最常用的---端口复用NAT--多个私网IP地址，转换成一个工网IP

静态Nat--做服务器映射--一对一--一个私网IP地址，对应一个公网IP

最不常用动态NAT ---一对一

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/2354lknm.png)





```tcl
pc(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.254
gw(config)#ip route 0.0.0.0 0.0.0.0 100.1.1.254
server(config)#ip route 0.0.0.0 0.0.0.0 10.1.1.254
baidu-gw(config)#ip route 0.0.0.0 0.0.0.0 200.1.1.254
###此时已经通了
gw(config)#do ping 200.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 200.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
gw(config)#


baidu-gw(config)#int e0/1
baidu-gw(config-if)#ip nat ins   
baidu-gw(config-if)#ip nat inside 
% NBAR Error: LEXER error : parsing stopped

% NBAR Error: Activation failed due to insufficient Dynamic Memory
% NBAR Error: Stile could not add protocol node 
%NAT: Error activating CNBAR on the interface Ethernet0/1
baidu-gw(config-if)#
*Oct 10 10:20:12.150: %SYS-2-MALLOCFAIL: Memory allocation of 135188 bytes failed from 0xC3A0311, alignment 8 
Pool: Processor  Free: 437388  Cause: Memory fragmentation 
Alternate Pool: None  Free: 0  Cause: No Alternate pool 
 -Process= "stile_activate_process", ipl= 0, pid= 236
-Traceback= 9C9743Az C5BCFE6z C5B5211z DCD706Fz C3A0311z C3A02AAz C388F95z C388E98z C388230z C388E61z C388230z C388E61z C388230z C388E61z C388230z C388E61z
baidu-gw(config-if)#
*Oct 10 10:20:12.150: %NBAR-2-NOMEMORY: No memory available for StILE lmalloc
-Traceback= 9C9743Az C3A0374z C3A02AAz C388F95z C388E98z C388230z C388E61z C388230z C388E61z C388230z C388E61z C388230z C388E61z C388230z C387EA6z C39884Ez
baidu-gw(config-if)#
*Oct 10 10:20:13.041: %LINEPROTO-5-UPDOWN: Line protocol on Interface NVI0, changed state to up
baidu-gw(config-if)#
baidu-gw(config-if)#exit
baidu-gw(config)#
baidu-gw(config)#
baidu-gw(config)#
baidu-gw(config)#int e0/0
baidu-gw(config-if)#
baidu-gw(config-if)#ip nat outs
baidu-gw(config-if)#ip nat outside 

baidu-gw(config)#ip nat inside source static 10.1.1.1 200.1.1.100

isp#ping 200.1.1.100
```

```tcl
gw(config-if)#ip nat outside 
% NBAR Error: LEXER error : parsing stopped

% NBAR Error: Activation failed due to insufficient Dynamic Memory
% NBAR Error: Stile could not add protocol node 
%NAT: Error activating CNBAR on the interface Ethernet0/1
gw(config-if)#
*Oct 10 10:52:30.398: %SYS-2-MALLOCFAIL: Memory allocation of 135188 bytes failed from 0xC3A0311, alignment 8 
Pool: Processor  Free: 510924  Cause: Memory fragmentation 
Alternate Pool: None  Free: 0  Cause: No Alternate pool 
 -Process= "stile_activate_process", ipl= 0, pid= 236
-Traceback= 9C9743Az C5BCFE6z C5B5211z DCD706Fz C3A0311z C3A02AAz C388F95z C388EF5z C388230z C388E61z C388230z C388E61z C388230z C388E61z C388230z C387EA6z
gw(config-if)#
*Oct 10 10:52:30.398: %NBAR-2-NOMEMORY: No memory available for StILE lmalloc
-Traceback= 9C9743Az C3A0374z C3A02AAz C388F95z C388EF5z C388230z C388E61z C388230z C388E61z C388230z C388E61z C388230z C387EA6z C39884Ez C3A191Cz C3A1A14z
*Oct 10 10:52:31.286: %LINEPROTO-5-UPDOWN: Line protocol on Interface NVI0, changed state to up
gw(config-if)#
gw(config-if)#exit
gw(config)#int e0/0
gw(config-if)#ip nat in
gw(config-if)#ip nat inside 
gw(config-if)#
gw(config-if)#
gw(config-if)#exit
gw(config)#
gw(config)#ip access-list standard 1
gw(config-std-nacl)#
gw(config-std-nacl)#
gw(config-std-nacl)#permit
gw(config-std-nacl)#permit 192.168.1.0  0.0.0.255
gw(config-std-nacl)#exit
gw(config)#ip nat pool cisco 100.1.1.100 100.1.1.200 netmas
gw(config)#ip nat pool cisco 100.1.1.100 100.1.1.200 netmask 255.255.255.0
gw(config)#ip nat inside source list 1 pool cisco
```

```tcl
pc#ping 200.1.1.100
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 200.1.1.100, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
pc#ping 20.1.1.1   
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 20.1.1.1, timeout is 2 seconds:
U.U.U
Success rate is 0 percent (0/5)
pc#ping 10.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.1, timeout is 2 seconds:
U.U.U
Success rate is 0 percent (0/5)
gw#show ip nat translations 
Pro Inside global      Inside local       Outside local      Outside global
--- 100.1.1.100        192.168.1.1        ---                ---
gw#
```

### PAT

见所有的流量转换成接口

```tcl
gw(config)# no ip nat inside source list 1 pool cisc
gw(config)#ip nat inside source list 1 interface e0/1 overload 
```

![](https://raw.githubusercontent.com/zhoujiuzhou9/PicGo/main/pic/36568124sss.png)